In [1]:
#Airthmetic Operation

In [5]:
import pandas as pd
var = pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "B" : [5,6,7,8]
    }
)
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [7]:
var["Sum "] = var["A"] + var["B"]
var["Sub "] = var["A"] - var["B"]
var["Mul "] = var["A"] * var["B"]
var["div "] = var["A"] / var["B"]
var

   A  B  Sum   Sub   Mul       div
0  1  5     6    -4     5  0.200000
1  2  6     8    -4    12  0.333333
2  3  7    10    -4    21  0.428571
3  4  8    12    -4    32  0.500000

In [8]:
var1 = pd.DataFrame(
    {
        "A" : [10,20,30,40],
        "B" : [50,60,70,80]
    }
)
var1

    A   B
0  10  50
1  20  60
2  30  70
3  40  80

In [14]:
var1["A<=20"] = var1["A"] <= 20
var1["B<=70"] = var1["B"] >= 70
var1

    A   B  A<=20  B<=60  B<=70
0  10  50   True  False  False
1  20  60   True  False  False
2  30  70  False   True   True
3  40  80  False   True   True